<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>pfm_name</key>
	<string>@APP_NAME@</string>
	<key>pfm_title</key>
	<string>@APP_NAME@</string>
	<key>pfm_description</key>
	<string>@APP_NAME@ preferences</string>
	<key>pfm_version</key>
	<real>1</real>
	<key>pfm_domain</key>
	<string>@CHROMIUM_BUNDLE_ID@</string>
	<key>pfm_subkeys</key>
	<array>
		<dict>
			<key>pfm_name</key>
			<string>HomepageLocation</string>
			<key>pfm_description</key>
			<string>This policy setting specifies the location of the default home page for the user. Specify a URL here, or set to the New Tab Page.  If the New Tab Page option is choosen, this will override a URL here.</string>
			<key>pfm_title</key>
			<string>The homepage URL.</string>
			<key>pfm_targets</key>
			<array>
				<string>user-managed</string>
			</array>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>HomepageIsNewTabPage</string>
			<key>pfm_description</key>
			<string>This policy setting specifies the location of the default home page for the user. The homepage can either be set to a URL you specify, or set to the New Tab Page.  If this New Tab Page option is choosen, this will override the URL location.</string>
			<key>pfm_title</key>
			<string>Use the New Tab Page as the home page.</string>
			<key>pfm_targets</key>
			<array>
				<string>user-managed</string>
			</array>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>ProxyServerMode</string>
			<key>pfm_description</key>
			<string>This policy allows you to specify the proxy server used by Google Chrome. If you choose to disable the proxy server settings by choosing always to use a direct connection, all other options will be ignored. If you specify a proxy server, the autodetect option will be ignored. For detailed examples, visit: http://www.chromium.org/developers/design-documents/network-settings#TOC-Command-line-options-for-proxy-sett 0 = Disabled, 1 = Autodetect, 2 = Manual, 3 = Use System Proxy</string>
			<key>pfm_title</key>
			<string>Choose how to specify proxy server settings</string>
			<key>pfm_targets</key>
			<array>
				<string>user-managed</string>
			</array>
			<key>pfm_type</key>
			<string>integer</string>
			<key>pfm_range_list</key>
			<array>
				<integer>0</integer>
				<integer>1</integer>
				<integer>2</integer>
				<integer>3</integer>
			</array>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>ProxyServer</string>
			<key>pfm_description</key>
			<string>This policy allows you to specify the proxy server used by Google Chrome. This is only used for a manual proxy setup.</string>
			<key>pfm_title</key>
			<string>The address of the proxy server.</string>
			<key>pfm_targets</key>
			<array>
				<string>user-managed</string>
			</array>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>ProxyPacUrl</string>
			<key>pfm_description</key>
			<string>This policy allows you to specify the proxy server used by Google Chrome. This is only used for a manual proxy setup.</string>
			<key>pfm_title</key>
			<string>The url to a proxy pac file</string>
			<key>pfm_targets</key>
			<array>
				<string>user-managed</string>
			</array>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>ProxyBypassList</string>
			<key>pfm_description</key>
			<string>This policy allows you to specify the proxy server used by Google Chrome. This is only used for a manual proxy setup.</string>
			<key>pfm_title</key>
			<string>Comma separated list of bypass rules.</string>
			<key>pfm_targets</key>
			<array>
				<string>user-managed</string>
			</array>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>AlternateErrorPagesEnabled</string>
			<key>pfm_description</key>
			<string>This policy enables the use of special error pages built into Google Chrome (such as &apos;page not found&apos;.)</string>
			<key>pfm_title</key>
			<string>Enable the special error pages.</string>
			<key>pfm_targets</key>
			<array>
				<string>user-managed</string>
			</array>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>SearchSuggestEnabled</string>
			<key>pfm_description</key>
			<string>This policy enables search suggestions in the Omnibox.</string>
			<key>pfm_title</key>
			<string>Enable the search suggestions.</string>
			<key>pfm_targets</key>
			<array>
				<string>user-managed</string>
			</array>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>DnsPrefetchingEnabled</string>
			<key>pfm_description</key>
			<string>This policy enables prefetching DNS names that are anticipated to be used.</string>
			<key>pfm_title</key>
			<string>Enable DNS Prefetching.</string>
			<key>pfm_targets</key>
			<array>
				<string>user-managed</string>
			</array>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>SafeBrowsingEnabled</string>
			<key>pfm_description</key>
			<string>This policy enables the Safe Browsing feature.</string>
			<key>pfm_title</key>
			<string>Enable Safe Browsing</string>
			<key>pfm_targets</key>
			<array>
				<string>user-managed</string>
			</array>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>MetricsReportingEnabled</string>
			<key>pfm_description</key>
			<string>This policy enables the anonymous reporting of usage and crash related data to Google.</string>
			<key>pfm_title</key>
			<string>Enable reporting of usage and crash related data.</string>
			<key>pfm_targets</key>
			<array>
				<string>user-managed</string>
			</array>
			<key>pfm_type</key>
			<string>boolean</string>
		</dict>
		<dict>
			<key>pfm_name</key>
			<string>DisabledPlugins</string>
			<key>pfm_description</key>
			<string>This policy specifies a list of plugins that are disabled. The policy value is a comma-separated list of the names of plugins to be disabled.</string>
			<key>pfm_title</key>
			<string>The list of disabled plugins.</string>
			<key>pfm_targets</key>
			<array>
				<string>user-managed</string>
			</array>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
	</array>
</dict>
</plist>
